Tekla Open API Reference for Tekla Structures 2025
View.CreateDetailView Method
 Generates a new detail view on the sheet of the active drawing and the associated detail mark for the specified view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateDetailView(
	View view,
	Point centerPoint,
	Point boundaryPoint,
	Point labelPoint,
	Point viewInsertionPoint,
	View.ViewAttributes viewAttributes,
	DetailMark.DetailMarkAttributes detailMarkAttributes,
	out View detailView,
	out DetailMark detailMark
)
Public Shared Function CreateDetailView (
	view As View,
	centerPoint As Point,
	boundaryPoint As Point,
	labelPoint As Point,
	viewInsertionPoint As Point,
	viewAttributes As View.ViewAttributes,
	detailMarkAttributes As DetailMark.DetailMarkAttributes,
	<OutAttribute> ByRef detailView As View,
	<OutAttribute> ByRef detailMark As DetailMark
) As Boolean
Parameters
view
Type: Tekla.Structures.Drawing.View
The view in which to place the detail mark.
centerPoint
Type: Tekla.Structures.Geometry3d.Point
The center point of the detail mark.
boundaryPoint
Type: Tekla.Structures.Geometry3d.Point
The boundary point of the detail mark.
labelPoint
Type: Tekla.Structures.Geometry3d.Point
The label point of the detail mark label.
viewInsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The point where to create the detail view.
viewAttributes
Type: Tekla.Structures.Drawing.View.ViewAttributes
The attributes for the detail view to be created.
detailMarkAttributes
Type: Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes
The attributes for the detail mark to be created.
detailView
Type: Tekla.Structures.Drawing.View
 The created detail view is returned if the creation was successful. Otherwise, null is returned.
detailMark
Type: Tekla.Structures.Drawing.DetailMark
 The created detail mark is returned if the creation was successful. Otherwise, null is returned.
Return Value
Type: Boolean
True if the detail view was created successfully.
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace